In [1]:
import numpy as np
import pandas as pd
from pandas import DataFrame, Series

In [2]:
dframe = DataFrame({'k1':['X','X','Y','Y','Z'],
                    'k2':['alpha','beta','alpha','beta','alpha'],
                    'dataset1':np.random.randn(5),
                    'dataset2':np.random.randn(5)})
dframe

   dataset1  dataset2 k1     k2
0 -1.729498 -0.443732  X  alpha
1 -0.897809 -0.851361  X   beta
2  1.520022 -0.657425  Y  alpha
3  0.012456  0.557182  Y   beta
4  0.398284 -2.265963  Z  alpha

In [3]:
group1=dframe['dataset1'].groupby(dframe['k1'])
group1

In [4]:
group1.mean()

k1
X   -1.313653
Y    0.766239
Z    0.398284
Name: dataset1, dtype: float64

In [5]:
group1.max()

k1
X   -0.897809
Y    1.520022
Z    0.398284
Name: dataset1, dtype: float64

In [6]:
cities=np.array(['NY','LA','LA','NY','NY'])

In [7]:
months=np.array(['Jan','Feb','Jan','Feb','Jan'])

In [8]:
dframe['dataset1'].groupby([cities,months]).mean()

LA  Feb   -0.897809
    Jan    1.520022
NY  Feb    0.012456
    Jan   -0.665607
Name: dataset1, dtype: float64

In [9]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -1.313653 -0.647546
Y   0.766239 -0.050121
Z   0.398284 -2.265963

In [10]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [11]:
dframe.groupby(['k1','k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -1.729498 -0.443732
   beta  -0.897809 -0.851361
Y  alpha  1.520022 -0.657425
   beta   0.012456  0.557182
Z  alpha  0.398284 -2.265963

In [13]:
for name,group in dframe.groupby('k1'):
    print("This is the %s group" %name)
    print (group)
    print ('\n')

This is the X group
   dataset1  dataset2 k1     k2
0 -1.729498 -0.443732  X  alpha
1 -0.897809 -0.851361  X   beta


This is the Y group
   dataset1  dataset2 k1     k2
2  1.520022 -0.657425  Y  alpha
3  0.012456  0.557182  Y   beta


This is the Z group
   dataset1  dataset2 k1     k2
4  0.398284 -2.265963  Z  alpha

In [15]:
for (k1,k2) , group in dframe.groupby(['k1','k2']):
    print ("Key1 = %s Key2 = %s" %(k1,k2))
    print (group)
    print ('\n')

Key1 = X Key2 = alpha
   dataset1  dataset2 k1     k2
0 -1.729498 -0.443732  X  alpha


Key1 = X Key2 = beta
   dataset1  dataset2 k1    k2
1 -0.897809 -0.851361  X  beta


Key1 = Y Key2 = alpha
   dataset1  dataset2 k1     k2
2  1.520022 -0.657425  Y  alpha


Key1 = Y Key2 = beta
   dataset1  dataset2 k1    k2
3  0.012456  0.557182  Y  beta


Key1 = Z Key2 = alpha
   dataset1  dataset2 k1     k2
4  0.398284 -2.265963  Z  alpha

In [16]:
group_dict = dict(list(dframe.groupby('k1')))

In [17]:
group_dict

{'X':    dataset1  dataset2 k1     k2
 0 -1.729498 -0.443732  X  alpha
 1 -0.897809 -0.851361  X   beta, 'Y':    dataset1  dataset2 k1     k2
 2  1.520022 -0.657425  Y  alpha
 3  0.012456  0.557182  Y   beta, 'Z':    dataset1  dataset2 k1     k2
 4  0.398284 -2.265963  Z  alpha}

In [20]:
group_dict['X']

   dataset1  dataset2 k1     k2
0 -1.729498 -0.443732  X  alpha
1 -0.897809 -0.851361  X   beta

In [21]:
group_dict_axis1 = dict(list(dframe.groupby(dframe.dtypes,axis=1)))
group_dict_axis1

{dtype('float64'):    dataset1  dataset2
 0 -1.729498 -0.443732
 1 -0.897809 -0.851361
 2  1.520022 -0.657425
 3  0.012456  0.557182
 4  0.398284 -2.265963, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [22]:
dataset2_group = dframe.groupby(['k1','k2'])[['dataset2']]

dataset2_group.mean()

          dataset2
k1 k2
X  alpha -0.443732
   beta  -0.851361
Y  alpha -0.657425
   beta   0.557182
Z  alpha -2.265963